{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "embedding_size": 768,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-FOOD",
    "2": "I-FOOD",
    "3": "B-STORE",
    "4": "I-STORE",
    "5": "B-QTY",
    "6": "I-QTY",
    "7": "B-PREF",
    "8": "I-PREF",
    "9": "B-LOC",
    "10": "I-LOC"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-FOOD": 1,
    "B-LOC": 9,
    "B-PREF": 7,
    "B-QTY": 5,
    "B-STORE": 3,
    "I-FOOD": 2,
    "I-LOC": 10,
    "I-PREF": 8,
    "I-QTY": 6,
    "I-STORE": 4,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.6",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 197285
}
